<?
$cfg =array(
	'rootDir' => '/ukk_test2'
	//,'img_url'=>'https://sineorb3.cafe24.com/'
	,'img_url'=>'https://sineorb3.openhost.cafe24.com/'
	,'img_600'=>'Design/mall_2/600'
	,'img_600_logo'=>'Design/web19/web/product/big'
	,'hold_loc'=>'116'
);

$cfg_color=array(
"table_tr"=>array("#fff","#eaeaea")
);

//가용재고위치
$psb_stock_loc=array('codeno_51','codeno_1','codeno_91','codeno_125','codeno_130');

/*주문페이지 재고노출 위치*/
$cfg_select_gcl=",gcl.cur_cnt,gcl.codeno_1,gcl.codeno_3,gcl.codeno_51,gcl.codeno_55,gcl.codeno_87,gcl.codeno_91,gcl.codeno_104,gcl.codeno_116,gcl.codeno_125,gcl.codeno_129,gcl.codeno_130";
$cfg_sum_gcl="codeno_1+codeno_51+codeno_87+codeno_91+codeno_125"; /*order.class에서 사용*/


/**/
$cfg_admin_memo=array('품절','SCM품절처리','문자전송','출고전취소','출고전취소-마진');

/* order_list step*/
/*
step 3 step2 1  보류중에 재고 있던제품
step 2 step2 1  품절중에 입고예정으로 기다릴것
step 1 step2 1  재고빠지기전에 부분품절이 있는 묶음에서 재고가 있는 제품
*/
$cfg_order_step=array(
"0"=>"모델명매칭"
,"1"=>"발송확인"
,"2"=>"재고부족/취소복원주문"
,"3"=>"발송대기(재고잡아둠)"
,"4"=>"발송확정목록"
,"5"=>"발송완료(송장등록완료)"
,"6"=>"외부발송"
,"7"=>"리퍼판매"
,"8"=>"보류"
,"50"=>"CS교환주문"
,"51"=>"CS교환주문(송장등록완료)"
,"55"=>"상품반송"
,"60"=>"위탁오더환불(AS,배송비지불)"
,"61"=>"위탁오더환불(반품)"
,"70"=>"CS출고"
);

/* order_list step2   1인경우는 step 이 3인 경우에만 사용*/
$cfg_order_step2=array(
"0"=>""
,"1"=>"대기재고있음/특수분류"
,"41"=>"품절취소접수"
,"42"=>"단순반품접수"
,"43"=>"하자반품접수"
,"44"=>"교환반품접수"
,"45"=>"주문취소"
,"46"=>"주문취소"
,"141"=>"품절취소완료"
,"142"=>"단순반품완료"
,"143"=>"하자반품완료"
,"144"=>"교환반품완료"
,"145"=>"주문취소"
,"146"=>"주문취소"
);

/*
$cfg_order_step2=array(
"0"=>""
,"1"=>"대기재고있음/특수분류"
,"41"=>"품절취소접수"
,"42"=>"단순반품접수"
,"43"=>"하자반품접수"
,"44"=>"교환반품접수"
,"45"=>"단순취소접수"
,"46"=>"주문취소"
,"141"=>"품절취소완료"
,"142"=>"단순반품완료"
,"143"=>"하자반품완료"
,"144"=>"교환반품완료"
,"145"=>"단순취소완료"
,"146"=>"주문취소"
);
*/


/*주문단계별 위치 노출값*/
/*
$cfg_order_step_view=array(
"0"=>array("0"=>"1.모델명매칭","1"=>"1.모델명매칭분류")
,"1"=>array("0"=>"3.단일발송확인","1"=>"4.묶음발송확인")
,"2"=>array("0"=>"2. 금일재고부족/취소복원 ","1"=>"2. 입고예정대기")
,"3"=>array("0"=>"5-2.발송대기","1"=>"5-2. 발송대기")
,"4"=>array("0"=>"7.발송확정목록","2"=>"5-3. 변경발송")
,"5"=>array("0"=>"발송완료(송장등록완료)")
,"6"=>array("0"=>"6.외부발송주문")
,"8"=>array("0"=>"5-1.보류")
);
*/
$cfg_order_step_view=array(
"0"=>array("0"=>"모델 매핑(단품)","1"=>"모델 매핑(묶음)")
,"1"=>array("0"=>"단품주문발송","1"=>"묶음주문발송")
,"2"=>array("0"=>"당일 품절","1"=>"입고예정")
,"3"=>array("0"=>"재고보류주문(묶음)","1"=>"재고보류주문(묶음)")
,"4"=>array("0"=>"재고확보","2"=>"모델변경주문(CS)")
,"5"=>array("0"=>"발송완료(송장등록완료)")
,"6"=>array("0"=>"위탁오더주문")
,"8"=>array("0"=>"재고이동중/특이주문")
,"50"=>array("0"=>"CS교환주문")
,"51"=>array("0"=>"CS교환주문(송장등록완료)")
,"55"=>array("0"=>"CS상품입고")
,"60"=>array("0"=>"위탁오더환불(AS,배송비지불)")
,"61"=>array("0"=>"위탁오더환불(반품)")
,"70"=>array("0"=>"CS출고")
);

$cfg_order_step_link=array(
"0"=>array("0"=>"../order/chk_order_info.php?")
,"1"=>array("0"=>"../order/order_final_chk.php?","1"=>"../order/order_final_chk_b.php?")
,"2"=>array("0"=>"../order/order_stock_shortage.php?","1"=>"../order/order_stock_shortage_stand.php?")
,"3"=>array("0"=>"../order/order_hold.php?","1"=>"../order/order_hold.php?")
,"4"=>array("0"=>"../order/order_settle.php?","2"=>"../order/order_settle.php?")
,"5"=>array("0"=>"")
,"6"=>array("0"=>"../order/order_outside.php?")
,"8"=>array("0"=>"../order/order_d_hold.php?")
,"41"=>array("0"=>"../order/order_cancel.php?")
);


$cfg_stock_io=array(
	"stock"=>"입고"
	,"move"=>"이동"
	,"reserve"=>"예역"
	,"reserve_release"=>"예약취소"
	,"return"=>"반환"
	,"order"=>"주문"
	,"order_cancel"=>"주문취소"
	,"order_hold"=>"발송대기"
	,"order_hold_cancel"=>"발송대기복원"
	,"order_d_hold"=>"보류"
	,"order_step_back"=>"주문발송후이전단계이동"
	,"cs_hold"=>"CS접수"
	,"cs_hold_cancel"=>"CS접수철회"
	,"cs_return"=>"CS반품완료"
	,"cs_exchange"=>"CS교환발송"
	,"cs_exchange_b"=>"CS교환발송완료"
	,"re_order"=>"품절CS재주문"
	,"stock_yn"=>""
	,"repairing"=>"CS하자재고차감"
	,"repaired"=>"CS수리완료"
	,"stock_change"=>"재고조정"
	,"stock_deficient"=>"예약재고차감"
	,"quick_move"=>"퀵시트"
	,"cs_cancel"=>"CS교환철회"
	,"cs_send"=>"CS출고"
	);

$cfg_place_type=array(
	"1"=>"입예"
	,"2"=>"본사"
	,"3"=>"외부"
	,"4"=>"타업체"
	,"5"=>"외부-미사용"
	,"6"=>"자체"
);

$cfg_call_type=array(
	"1"=>"콜백"
	,"2"=>"진행중"
	,"3"=>"완료"
);
$cfg_route_type=array(
	"1"=>"인바운드"
	,"2"=>"아웃바운드"
	,"3"=>"카톡"
	,"4"=>"게시판"
	,"5"=>"외부몰"
	);

$cfg_retrun_type=array(
	"1"=>"일반"
	,"2"=>"반품"
	,"3"=>"교환"
	,"4"=>"AS"
	,"5"=>"재주문"
	,"6"=>"배송"
	,"40"=>"출고"
	,"50"=>"기타처리"
	,"60"=>"반품접수"
	,"70"=>"교환접수"
	,"80"=>"품절취소"
	,"90"=>"상품입고"	
	,"99"=>"기타"
	#,"20"=>"반품(하자)"
	#,"21"=>"반품(단순)"
	#,"40"=>"교환(하자)"
	#,"41"=>"교환(단순)"
	);

$cfg_retrun_type_sub=array(
	"1"=>array(
		"1"=>"상품문의"
		,"2"=>"작동법"
		,"3"=>"재고문의"
		,"4"=>"보증서문의"
		,"5"=>"단순취소"
		,"6"=>"퀵"
	)
	,"2"=>array(
		"1"=>"단순반품"
		,"2"=>"불량반품"
	)
	,"3"=>array(
		"1"=>"단순교환"
		,"2"=>"불량교환"
	)
	,"4"=>array(
		"1"=>"일반상담"
		,"2"=>"접수문의"
		,"3"=>"비용문의"
		,"4"=>"완료일정"
	)
	,"5"=>array(
		"1"=>"마진취소"
	)
	,"6"=>array(
		"1"=>"품절"
		,"2"=>"배송지연"
		,"3"=>"출고문의"
		,"4"=>"주소변경"
	)
	,"40"=>array(
		"1"=>"분실출고"
		,"2"=>"맞교환출고"
		,"3"=>"반품입고후출고"
	)
	,"50"=>array(
		"1"=>"AS이관"
		,"2"=>"기타완료"
	)
	,"60"=>array(
		"1"=>"단순반품"
		,"2"=>"불량반품"
		,"3"=>"위탁반품"
		,"4"=>"상품회수"
	)
	,"70"=>array(
		"1"=>"단순교환"
		,"2"=>"불량교환"
		,"3"=>"위탁교환"
	)
	,"90"=>array(
		"1"=>"상품입고"
		,"2"=>"상품반송"
	)
);

$cfg_send_type=array(
	"0"=>""
	,"1"=>"접수"
	,"2"=>"발송처리"
	,"3"=>"입고처리"
	,"4"=>"처리완료"
	,"20"=>"재주문접수(품절)"
	,"21"=>"재주문완료(품절)"
	,"90"=>"철회접수"
	,"91"=>"철회완료"
);

$cfg_return_delivery_type=array(
	"1"=>"신용"
	,"2"=>"선불"
	,"3"=>"착불"
	,"4"=>"즉납"
);

$cfg_return_delivery_type2=array(
	"1"=>"동봉"
	,"2"=>"미동봉"
	,"3"=>"입금"
);

$cfg_mall_detail=array(
"sabang"=>"사방넷",
"timemecca"=>"타임메카",
"storepam"=>"스토어팜",
"sellpia"=>"셀피아",
"offi"=>"오피셜",
"TVshopping"=>"방송",
"B2B"=>"B2B"
);

$cfg_receipt_type=array(
	"1"=>"반품"
	,"2"=>"교환"
	,"3"=>"AS"
	,"4"=>"상품입고"

);
$cfg_receipt_type_sub=array(
	"1"=>array(
		"1"=>"단순반품"
		,"2"=>"불량반품"
	)
	,"2"=>array(
		"1"=>"단순교환"
		,"2"=>"불량교환"
	)

);

$cfg_courier_code=array(
"01"=>"CJ대한통운"
);

$cfg_as_cate=array(
	"1"=>"시계"
	,"2"=>"쥬얼리"
	,"3"=>"잡화"
	,"99"=>"기타"
);

$cfg_as_sub_cate=array(
	"1"=>array(
		"1"=>"쿼츠"
		,"2"=>"오토"
	)
);

$cfg_as_contents=array(
	"1"=>array(
		"5"=>"공식본사AS"
		,"1"=>"배터리교체"
		,"2"=>"오버홀"
		,"3"=>"폴리싱"
		,"4"=>"글라스교체"
		,"98"=>"기타1"
		,"99"=>"기타2"
	)
	,"2"=>array(
		"1"=>"끊어짐수리"
		,"2"=>"줄줄임"
		,"3"=>"폴리싱"
		,"4"=>"변색제거"
		,"5"=>"큐빅빠짐"
		,"98"=>"기타1"
		,"99"=>"기타2"
	)
	,"3"=>array(
		"1"=>"가죽손상"
		,"2"=>"옆면마감"
		,"3"=>"박음질수선"
		,"4"=>"금속장식수리"
		,"5"=>"펜촉수리"
		,"6"=>"본사수리"
		,"98"=>"기타1"
		,"99"=>"기타2"
		)
	,"99"=>array(
		"98"=>"기타1"
		,"99"=>"기타2"
		)
);


$cfg_as_status=array(
	"0"=>"상품관련진행"
	,"1"=>"구매 및 수리내역 확인불가"
	,"2"=>"접수진행완료"
	,"3"=>"견적확인 및 입금요청"
	,"4"=>"입금확인 및 수리진행"
	,"5"=>"배송준비중 주소확인"
	,"6"=>"수리완료 및 배송진행"
);

$cfg_sms_status=array(
	"1"=>"안내문자"
	,"2"=>"반품"
	,"3"=>"교환"
	,"4"=>"AS"
	,"5"=>"CS"
);

$cfg_account_code=array(
	'001'=>'한국은행',
	'002'=>'산업은행',
	'003'=>'기업은행',
	'004'=>'국민은행',
	'007'=>'수협은행',
	'008'=>'수출입은행',
	'011'=>'농협은행',
	'012'=>'지역농․축협',
	'020'=>'우리은행',
	'023'=>'SC제일은행',
	'027'=>'한국씨티은행',
	'031'=>'대구은행',
	'032'=>'부산은행',
	'034'=>'광주은행',
	'035'=>'제주은행',
	'037'=>'전북은행',
	'039'=>'경남은행',
	'041'=>'우리카드',
	'044'=>'외환카드',
	'045'=>'새마을금고중앙회',
	'048'=>'신협',
	'050'=>'저축은행',
	'052'=>'모건스탠리은행',
	'054'=>'HSBC은행',
	'055'=>'도이치은행',
	'057'=>'제이피모간체이스은행',
	'058'=>'미즈호은행',
	'059'=>'엠유에프지은행',
	'060'=>'BOA은행',
	'061'=>'비엔피파리바은행',
	'062'=>'중국공상은행',
	'063'=>'중국은행',
	'064'=>'산림조합중앙회',
	'065'=>'대화은행',
	'066'=>'교통은행',
	'067'=>'중국건설은행',
	'071'=>'우체국',
	'076'=>'신용보증기금',
	'077'=>'기술보증기금',
	'081'=>'하나은행',
	'088'=>'신한은행',
	'089'=>'케이뱅크',
	'090'=>'카카오뱅크',
	'101'=>'한국신용정보원',
	'102'=>'대신저축은행',
	'103'=>'에스비아이저축은행',
	'104'=>'에이치케이저축은행',
	'105'=>'웰컴저축은행',
	'106'=>'신한저축은행'
);

$cfg_finance_code=array(
	'209'=>'유안타증권',
	'218'=>'KB증권',
	'221'=>'상상인증권',
	'222'=>'한양증권',
	'223'=>'리딩투자증권',
	'224'=>'BNK투자증권',
	'225'=>'IBK투자증권',
	'227'=>'KTB투자증권',
	'238'=>'미래에셋대우',
	'240'=>'삼성증권',
	'243'=>'한국투자증권',
	'247'=>'NH투자증권',
	'261'=>'교보증권',
	'262'=>'하이투자증권',
	'263'=>'현대차증권',
	'264'=>'키움증권',
	'265'=>'이베스트투자증권',
	'266'=>'SK증권',
	'267'=>'대신증권',
	'269'=>'한화투자증권',
	'270'=>'하나금융투자',
	'278'=>'신한금융투자',
	'279'=>'DB금융투자',
	'280'=>'유진투자증권',
	'287'=>'메리츠종합금융증권',
	'288'=>'카카오페이증권',
	'290'=>'부국증권',
	'291'=>'신영증권',
	'292'=>'케이프투자증권',
	'293'=>'한국증권금융',
	'294'=>'한국포스증권',
	'295'=>'우리종합금융',
	'299'=>'아주캐피탈',
	'361'=>'BC카드',
	'364'=>'광주카드',
	'365'=>'삼성카드',
	'366'=>'신한카드',
	'367'=>'현대카드',
	'368'=>'롯데카드',
	'369'=>'수협카드',
	'370'=>'씨티카드',
	'371'=>'NH카드',
	'372'=>'전북카드',
	'373'=>'제주카드',
	'374'=>'하나SK카드',
	'381'=>'KB국민카드',
	'431'=>'미래에셋생명',
	'432'=>'한화생명',
	'433'=>'교보라이프플래닛생명',
	'434'=>'푸본현대생명',
	'435'=>'라이나생명',
	'436'=>'교보생명',
	'437'=>'에이비엘생명',
	'438'=>'신한생명',
	'439'=>'KB생명보험',
	'440'=>'농협생명',
	'441'=>'삼성화재',
	'442'=>'현대해상',
	'443'=>'DB손해보험',
	'444'=>'KB손해보험',
	'445'=>'롯데손해보험',
	'446'=>'오렌지라이프생명보험',
	'447'=>'악사손해보험',
	'448'=>'메리츠화재',
	'449'=>'농협손해보험',
	'450'=>'푸르덴셜생명보험',
	'452'=>'삼성생명',
	'453'=>'흥국생명',
	'454'=>'한화손해보험',
	'455'=>'AIA생명보험 ',
	'456'=>'DGB생명보험',
	'457'=>'DB생명보험',
	'458'=>'KDB생명보험'
);

$cfg_goods_info=array(
	//시계
		"001"=>array(
			"material2"=>"재질2(밴드)"		
		)
	//잡화
		,"002"=>array(
			"material2"=>""
			,"width2"=>"벨트버클 가로"
			,"height2"=>"벨트버클 세로"
		)
	//쥬얼리
		,"003"=>array(
			"material2"=>"재질2(팬던트)"
			,"width2"=>"팬던트 가로"
			,"height2"=>"팬던트 세로"
			)
	//의류
		,"004"=>array(
			"material2"=>""
			)
	//생활용품
	/*
		,"005"=>array(
			"material"=>""
			,"material2"=>""
			)
			*/
	);

	$cfg_bad=array(
		"1"=>"하자입고",
		"20"=>"접수",
		"40"=>"자체수리",
		"41"=>"자체수리(해외자재요청)",
		"42"=>"국내본사수리요청",
		"43"=>"해외본사수리요청",
		"60"=>"수리완료",
		"61"=>"수리불가(폐기)",
		"62"=>"리퍼",
		"80"=>"폐기리스트"
	);


$cfg_place_code=array(
"입고 예정"=>""
,"3자물류"=>"1010"
,"사무실"=>"1010"
,"롯데묘미"=>""
,"마케팅매입"=>"8050"
,"방송"=>"8080"
,"재고 체크"=>"1010"
,"사진 샘플"=>"1010"
,"쇼룸 DP"=>"8090"
,"골든 샘플"=>"8120"
,"외부 샘플"=>"8130"
,"프리스로우(원주)"=>"8030"
,"인비트리(프라다 위탁)"=>"8040"
,"마케팅 샘플(협찬)"=>"8060"
,"연예인협찬"=>"8060"
,"현대백화점 위탁"=>"8070"
,"한성INC"=>"8140"
,"현대홈쇼핑"=>""
,"저스트원더"=>""
,"원마케팅"=>"8170"
,"11번가"=>"8180"
,"평택"=>"8190"
,"영인터"=>""
,"LF사입"=>""
,"쿠팡"=>""
,"발송대기"=>"1010"
,"퀵시트"=>"1010"
,"재고보류"=>"1010"
,"재고이동중"=>"1010"
);

/*사방넷 연동용 상품 속성정보 코드( 정보고시 노출용)*/
$cfg_prop_code['001']="의류";
$cfg_prop_code['002']="구두/신발";
$cfg_prop_code['003']="가방";
$cfg_prop_code['004']="패션잡화(모자/벨트/액세서리)";
$cfg_prop_code['005']="침구류/커튼";
$cfg_prop_code['006']="가구(침대/소파/싱크대/DIY제품)";
$cfg_prop_code['007']="영상가전(TV류)";
$cfg_prop_code['008']="가정용전기제품(냉장고/세탁기/식기세척기/전자)";
$cfg_prop_code['009']="계절가전(에어컨/온풍기)";
$cfg_prop_code['010']="사무용기기(컴퓨터/노트북/프린터)";
$cfg_prop_code['011']="광학기기(디지털카메라/캠코더)";
$cfg_prop_code['012']="소형전자(MP3/전자사전등)";
$cfg_prop_code['013']="휴대폰";
$cfg_prop_code['014']="내비게이션";
$cfg_prop_code['015']="자동차용품(자동차부품/기타자동차용품)";
$cfg_prop_code['016']="의료기기";
$cfg_prop_code['017']="주방용품";
$cfg_prop_code['018']="화장품";
$cfg_prop_code['019']="귀금속/보석/시계류";
$cfg_prop_code['020']="식품(농수산물)";
$cfg_prop_code['021']="가공식품";
$cfg_prop_code['022']="건강기능식품";
$cfg_prop_code['023']="영유아용품";
$cfg_prop_code['024']="악기";
$cfg_prop_code['025']="스포츠용품";
$cfg_prop_code['026']="서적";
$cfg_prop_code['027']="호텔/펜션예약";
$cfg_prop_code['028']="여행패키지";
$cfg_prop_code['029']="항공권";
$cfg_prop_code['030']="자동차대여서비스(렌터카)";
$cfg_prop_code['031']="물품대여서비스(정수기/비데/공기청정기등)";
$cfg_prop_code['032']="물품대여서비스(서적/유아용품/행사용품등)";
$cfg_prop_code['033']="디지털콘텐츠(음원/게임/인터넷강의등)";
$cfg_prop_code['034']="상품권/쿠폰";
$cfg_prop_code['035']="기타";


$cfg_size_cut_patten['1']="(";
$cfg_size_cut_patten['2']="-";
$cfg_size_cut_patten['3']=" ";

?>